Section_4_Real_Workload_Validation/Experiment13/data/raw/case-B/sustained-ramp/trial_017/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 18.609ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 18.479ms, rate sampling interval: 54ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.79ms   10.65ms 257.79ms   93.07%
    Req/Sec   251.88     54.17   781.00     74.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.48ms
 75.000%   19.38ms
 90.000%   26.09ms
 99.000%   54.37ms
 99.900%  179.07ms
 99.990%  250.24ms
 99.999%  257.79ms
100.000%  257.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.911     0.000000            1         1.00
      12.991     0.100000         8500         1.11
      13.823     0.200000        17052         1.25
      14.639     0.300000        25492         1.43
      15.511     0.400000        33986         1.67
      16.479     0.500000        42473         2.00
      16.991     0.550000        46760         2.22
      17.503     0.600000        50979         2.50
      18.031     0.650000        55303         2.86
      18.607     0.700000        59519         3.33
      19.375     0.750000        63750         4.00
      19.935     0.775000        65856         4.44
      20.655     0.800000        67980         5.00
      21.583     0.825000        70079         5.71
      22.799     0.850000        72205         6.67
      24.127     0.875000        74339         8.00
      25.007     0.887500        75395         8.89
      26.095     0.900000        76447        10.00
      27.375     0.912500        77517        11.43
      28.799     0.925000        78574        13.33
      30.399     0.937500        79637        16.00
      31.503     0.943750        80165        17.78
      32.831     0.950000        80703        20.00
      34.143     0.956250        81234        22.86
      35.551     0.962500        81759        26.67
      37.791     0.968750        82289        32.00
      38.911     0.971875        82553        35.56
      40.447     0.975000        82821        40.00
      42.047     0.978125        83083        45.71
      44.319     0.981250        83351        53.33
      47.167     0.984375        83614        64.00
      48.735     0.985938        83748        71.11
      50.367     0.987500        83880        80.00
      52.863     0.989062        84013        91.43
      55.519     0.990625        84145       106.67
      58.815     0.992188        84278       128.00
      60.767     0.992969        84344       142.22
      63.583     0.993750        84411       160.00
      66.431     0.994531        84478       182.86
      69.695     0.995313        84543       213.33
      75.135     0.996094        84610       256.00
      78.463     0.996484        84643       284.44
      83.071     0.996875        84677       320.00
      92.607     0.997266        84709       365.71
     102.399     0.997656        84742       426.67
     121.791     0.998047        84776       512.00
     127.103     0.998242        84792       568.89
     134.655     0.998437        84809       640.00
     152.959     0.998633        84825       731.43
     171.519     0.998828        84842       853.33
     179.967     0.999023        84859      1024.00
     184.319     0.999121        84867      1137.78
     185.727     0.999219        84876      1280.00
     189.055     0.999316        84883      1462.86
     195.199     0.999414        84892      1706.67
     203.903     0.999512        84901      2048.00
     208.639     0.999561        84904      2275.56
     213.631     0.999609        84909      2560.00
     217.599     0.999658        84912      2925.71
     227.455     0.999707        84917      3413.33
     236.799     0.999756        84921      4096.00
     238.591     0.999780        84923      4551.11
     242.047     0.999805        84925      5120.00
     243.967     0.999829        84927      5851.43
     248.191     0.999854        84929      6826.67
     249.727     0.999878        84931      8192.00
     249.855     0.999890        84932      9102.22
     250.239     0.999902        84934     10240.00
     250.239     0.999915        84934     11702.86
     253.439     0.999927        84935     13653.33
     253.695     0.999939        84936     16384.00
     254.591     0.999945        84937     18204.44
     254.591     0.999951        84937     20480.00
     255.487     0.999957        84938     23405.71
     255.487     0.999963        84938     27306.67
     255.615     0.999969        84939     32768.00
     255.615     0.999973        84939     36408.89
     255.615     0.999976        84939     40960.00
     257.791     0.999979        84940     46811.43
     257.791     0.999982        84940     54613.33
     257.791     0.999985        84940     65536.00
     257.791     0.999986        84940     72817.78
     257.791     0.999988        84940     81920.00
     257.919     0.999989        84941     93622.86
     257.919     1.000000        84941          inf
#[Mean    =       18.790, StdDeviation   =       10.647]
#[Max     =      257.792, Total count    =        84941]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89986 requests in 3.00m, 73.20MB read
Requests/sec:    499.92
Transfer/sec:    416.43KB